Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: C<Object::Tiny> is the absolute minimal option.
es: C<Object::Tiny> es la opción más minimalista.

source: C<Role::Tiny> provides some of the same features as Moose's role system, but in a much smaller package.
es: C<Role::Tiny> ofrece algunas de las características que proporciona el sistema Moose, pero en un paquete mucho más pequeño.

source: C<S<git add --interactive>> allows you to even just commit portions of files instead of all the changes in them.
es: C<S<git add --interactive>> permite confirmar sólo partes de archivos, en lugar de todos los cambios de los archivos.

source: C<UNITCHECK> blocks are run just after the unit which defined them has been compiled.
es: Los bloques C<UNITCHECK> se ejecutan inmediatamente después de que se haya compilado la unidad que los definió.

source: C<UNITCHECK>, C<CHECK> and C<INIT> code blocks are useful to catch the transition between the compilation phase and the execution phase of the main program.
es: Los bloques C<UNITCHECK>, C<CHECK> e C<INIT> son útiles para capturar la transición entre la fase de compilación y la de ejecución del programa principal.

source: C is internally known as C<utf-8-strict>.
es: Internamente, C se denomina C<utf-8-strict>.

source: C is the official standard.
es: C es el estándar oficial.

source: C in the usual double-quoted string means a control-A.
es: C en una cadena escrita entre comillas dobles normal equivale a control-A.

source: C through C are always interpreted as backreferences.
es: C a C siempre se interpretan como retrorreferencias.

source: C<\b> still means to match at the boundary between C<\w> and C<\W>, using the C</a> definitions of them (similarly for C<\B>).
es: Con la definición de C</a>, C<\b> sigue detectando el límite entre C<\w> y C<\W> (y lo mismo para C<\B>).

source: C<\g{-1}> can be used to refer to a group by relative rather than absolute position; and groups can be also be named, and referred to later by name rather than number.
es: Se puede usar C<\g{-1}> para hacer referencia a un grupo por posición relativa en lugar de absoluta; también se puede asignar un nombre a un grupo y posteriormente hacer referencia a ese nombre en lugar de usar el número correspondiente.

source: C<\p{}> did not imply Unicode rules, and neither did all occurrences of C<\N{}>, until 5.12.
es: C<\p{}> no implicaba usar las reglas de Unicode, como era el caso de C<\N{}>, hasta 5.12.

source: C<eval>ed strings are compiled in the package in which the eval() was compiled.
es: Las cadenas evaluadas con C<eval> se compilan en el paquete en que se compiló la función eval()

source: C<git bisect reset> will get you out of bisect mode.
es: Con C<git bisect reset> saldrá del modo de bisección.

source: C<git bisect> performs a binary search of history to locate the first failing commit.
es: C<git bisect> realiza una búsqueda binaria del historial para localizar la primera confirmación en la que se produjo el error.

source: C<git help bisect> has much more information on how you can tweak your binary searches.
es: C<git help bisect> ofrece mucha más información sobre cómo puede manipular las búsquedas binarias.

source: C<git> provides a built-in way to determine which commit should be blamed for introducing a given bug.
es: C<git> proporciona una forma integrada de determinar qué confirmación es responsable de un error.

source: C<module-starter> or C<h2xs> will provide a stub for you to fill in; if you're not sure about the format, look at L<perlpod> for an introduction.
es: C<module-starter> y C<h2xs> proporcionan un esqueleto que puede rellenar; si no conoce el formato POD y desea ver una introducción, consulte L<perlpod>.

source: C<my> creates lexically scoped variables instead.
es: En cambio, C<my> crea variables dentro de un ámbito léxico.

source: C<pack(" U*", @stuff)> will have C<U> as the first active character, even though it's not the first thing in the pattern.
es: C<pack(" U*", @algo)> tendrá C<U> como primer carácter activo, pero no es el primer carácter del patrón.

source: C<perldoc> also searches directories specified by the C<PERL5LIB> (or C<PERLLIB> if C<PERL5LIB> is not defined) and C<PATH> environment variables.
es: C<perldoc> también busca en los directorios especificados por las variables de entorno C<PERL5LIB> (o C<PERLLIB> si C<PERL5LIB> no está definida) y C<PATH>

source: C<perldoc> will use, in order of preference, the pager defined in C<PERLDOC_PAGER>, C<MANPAGER>, or C<PAGER> before trying to find a pager on its own.
es: C<perldoc> usará (por orden de preferencia) el paginador definido en C<PERLDOC_PAGER>, C<MANPAGER> o C<PAGER> antes de intentar localizar un paginador

source: C<quotemeta()> and C<\Q> are fully described in L<perlfunc/quotemeta>.
es: C<quotemeta()> y C<\Q> se describen de forma detallada en L<perlfunc/quotemeta>.

source: C<sprintf "%u", -1> therefore provides the same result as C<sprintf "%u", ~0>.
es: Así, C<sprintf "%u", -1> produce el mismo resultado que C<sprintf "%u", ~0>.

source: C<sv>, C<av>, C<hv>, etc. represent variables of their respective types.
es: C<sv>, C<av>, C<hv>, etc. representan variables de sus tipos respectivos.

source: C<use bytes> is usually a failed attempt to do something useful.
es: C<use bytes> suele ser un intento fallido de hacer algo útil.

source: C<use feature 'unicode_strings'> tells Perl to treat all characters as Unicode, whether the string is encoded in UTF-8 or not, thus avoiding the problem.
es: C<use feature 'unicode_strings'> indica a Perl que debe tratar todos los caracteres como Unicode, independientemente de si la cadena está codificada como UTF-8 o no, lo que evita el problema.

source: C<use strict 'refs'> forbids such practice.
es: C<use strict 'refs'> prohíbe hacer esto.

source: C is Perl's way of being liberal in what it accepts.
es: C es la manera que tiene Perl de mostrarse liberal al procesar la entrada.

# CHECK blocks run LIFO after all compilation. " }
source: CHECK blocks run LIFO after all compilation.\n" }
es: Los bloques CHECK se ejecutan en orden LIFO tras la compilación.\n" }

source: CONFIGURATION (?>p) no backtrack \pP named property
es: CONFIGURACIÓN (?>p) sin vuelta atrás \pP propiedad con nombre

source: CONTEXTS SIGILS ref ARRAYS HASHES
es: CONTEXTOS SIGILOS ref ARRAYS HASHES

source: CPAN contains tens of thousands of modules and extensions, source code and documentation, designed for I<everything> from commercial database interfaces to keyboard/screen control and running large web sites.
es: En CPAN puede encontrar decenas de millares de módulos y extensiones, código fuente y documentación, diseñados para I<todo tipo> de aplicaciones, como interfaces de bases de datos comerciales, control de pantalla y teclado, o sitios web de gran complejidad.

source: CPAN has several JAPH programs at http://www.cpan.org/misc/japh .
es: En CPAN encontrará varios programas JAPH, en http://www.cpan.org/misc/japh.

source: CPAN stands for Comprehensive Perl Archive Network, a multi-gigabyte archive replicated on hundreds of machines all over the world.
es: CPAN es la sigla de I<Comprehensive Perl Archive Network>, un repositorio que ocupa muchos gigabytes y está replicado en cientos de equipos del planeta.

source: CPAN, or the Comprehensive Perl Archive Network L<http://www.cpan.org/>, is a replicated, worldwide repository of Perl software.
es: CPAN, o Comprehensive Perl Archive Network ( L<http://www.cpan.org/> ), es un repositorio de software Perl replicado en todo el mundo.

source: Call your subroutines as if they were functions or list operators to avoid excessive ampersands and parentheses.
es: Llame a las subrutinas como si fueran funciones u operadores de lista para evitar un número excesivo de signos & y paréntesis.

source: Calling a method on an object is written as C<< $object->method >>.
es: La llamada a un método de un objeto se hace de la forma siguiente: C<< $objeto->método >>.

source: Can also mean L</indirect object>.
es: También puede significar L</objeto indirecto>.

source: Capture group contents are dynamically scoped and available to you outside the pattern until the end of the enclosing block or until the next successful match, whichever comes first.
es: El contenido de un grupo de captura tiene ámbito dinámico y está disponible fuera del patrón hasta el final del bloque que lo define o hasta la siguiente coincidencia, lo que ocurra primero.

source: Capture groups contained by the pattern will have the value as determined by the outermost recursion.
es: Los grupos de captura contenidos en el patrón tendrán el valor determinado por la recursividad más externa.

source: Capture groups are numbered from left to right, but inside this construct the numbering is restarted for each branch.
es: Los grupos de captura se numeran de izquierda a derecha, pero dentro de esta construcción la numeración se reinicia en cada rama.

source: Case I<is> significant--"FOO", "Foo", and "foo" are all different names.
es: Se distinguen mayúsculas de minúsculas: "FOO", "Foo" y "foo" se consideran nombres diferentes.

source: Categories of modules range from text manipulation to network protocols to database integration to graphics.
es: Las categorías de módulos abarcan desde la manipulación de texto hasta protocolos de red, integración de bases de datos o gráficos.

source: Certain operations return list values in contexts wanting a list, and scalar values otherwise.
es: Algunas operaciones devuelven una lista de valores en contextos que esperan una lista, y un valor escalar en caso contrario.

source: Certainly they mean two different things on the I<left> side of the C<s///>.
es: Significan dos cosas distintas en el lado I<izquierdo> de C<s///>.

source: Changes to these modules should be submitted to the maintainer of the CPAN module.
es: Los cambios realizados en estos módulos deben enviarse al mantenedor del módulo de CPAN.

source: Changing a class's parent class or adding subroutines to a class will invalidate the cache for that class.
es: Cambiar la clase primaria de una clase o agregar una subrutina a una clase invalidará el contenido de la caché para dicha clase.

source: Changing parts of a string via the C<s///> operator.
es: Modificación de partes de una cadena mediante el operador C<s///>.

source: Characters may be specified using a metacharacter syntax much like that used in C: "\n" matches a newline, "\t" a tab, "\r" a carriage return, "\f" a form feed, etc. More generally, \I<nnn>, where I<nnn> is a string of three octal digits, matches the character whose coded character set value is I<nnn>.
es: Los caracteres se pueden especificar con una sintaxis de metacaracteres, similar a la utilizada en C: "\n" detecta una nueva línea, "\t" una tabulación, "\r" un retorno de carro, "\f" un avance de página, etc. En términos más generales, \I<nnn>, donde I<nnn> es una cadena de tres dígitos octales, detecta el carácter cuyo valor codificado del juego de caracteres es I<nnn>.

source: Chat scripts were just drivers for existing programs, not stand-alone programs in their own right.
es: Los scripts de chat sólo eran activadores de programas existentes, no programas autónomos por derecho propio.

source: Check the documentation on an individual feature to verify its current status.
es: Consulte la documentación de una característica individual para comprobar su estado actual de implementación.

source: Check your decompression and unpacking utilities settings to make sure they are translating text files properly.
es: Compruebe la configuración de sus herramientas para descomprimir y desempaquetar; asegúrese de que traducen correctamente los archivos de texto.

source: Check L<perlop> for more detail.)
es: Consulte L<perlop> para obtener más información).

source: Check the CPAN Testers if a module should work with your platform but it doesn't behave as you'd expect, or you aren't sure whether or not a module will work under your platform.
es: Consulte la información de CPAN Testers para comprobar si se espera que el módulo funcione en su plataforma en caso de que no se comporte de la manera esperada, o si no está seguro de si un módulo funcionará en su plataforma.

source: Check the contents of the distribution.
es: Compruebe el contenido de la distribución.

source: Checks if a group with the given name has matched something.
es: Comprueba si un grupo con el nombre especificado coincide con algo.

source: Checks if the expression has been evaluated inside of recursion.
es: Comprueba si la expresión se ha evaluado dentro de la recursión.

source: Checks if the expression has been evaluated while executing directly inside of the n-th capture group.
es: Comprueba si la expresión se ha evaluado al ejecutarse directamente en el interior del n-ésimo grupo de captura.

source: Checks if the numbered capturing group has matched something.
es: Comprueba si el grupo de captura numerado coincide con algo.

source: Checks whether the pattern matches (or does not match, for the '!' variants).
es: Comprueba si el patrón coincide (o no coincide, para las variantes con '!').

source: Child
es: Hijo

source: Chip 5.003_08 1996-Nov-19 5.003_09 1996-Nov-26 5.003_10 1996-Nov-29 5.003_11 1996-Dec-06 5.003_12 1996-Dec-19 5.003_13 1996-Dec-20 5.003_14 1996-Dec-23 5.003_15 1996-Dec-23 5.003_16 1996-Dec-24 5.003_17 1996-Dec-27 5.003_18 1996-Dec-31 5.003_19 1997-Jan-04 5.003_20 1997-Jan-07 5.003_21 1997-Jan-15 5.003_22 1997-Jan-16 5.003_23 1997-Jan-25 5.003_24 1997-Jan-29 5.003_25 1997-Feb-04 5.003_26 1997-Feb-10 5.003_27 1997-Feb-18 5.003_28 1997-Feb-21 5.003_90 1997-Feb-25 Ramping up to the 5.004 release.
es: Chip 5.003_08 1996-Nov-19 5.003_09 1996-Nov-26 5.003_10 1996-Nov-29 5.003_11 1996-Dic-06 5.003_12 1996-Dic-19 5.003_13 1996-Dic-20 5.003_14 1996-Dic-23 5.003_15 1996-Dic-23 5.003_16 1996-Dic-24 5.003_17 1996-Dic-27 5.003_18 1996-Dic-31 5.003_19 1997-Ene-04 5.003_20 1997-Ene-07 5.003_21 1997-Ene-15 5.003_22 1997-Ene-16 5.003_23 1997-Ene-25 5.003_24 1997-Ene-29 5.003_25 1997-Feb-04 5.003_26 1997-Feb-10 5.003_27 1997-Feb-18 5.003_28 1997-Feb-21 5.003_90 1997-Feb-25 Preparación de v5.004.

source: Chip 5.003_08 1996-Nov-19 110 19 424 5.003_09 1996-Nov-26 38 9 248 5.003_10 1996-Nov-29 29 2 27 5.003_11 1996-Dec-06 73 12 165 5.003_12 1996-Dec-19 275 6 436 5.003_13 1996-Dec-20 95 1 56 5.003_14 1996-Dec-23 23 7 333 5.003_15 1996-Dec-23 0 0 1 5.003_16 1996-Dec-24 12 3 50 5.003_17 1996-Dec-27 19 1 14 5.003_18 1996-Dec-31 21 1 32 5.003_19 1997-Jan-04 80 3 85 5.003_20 1997-Jan-07 18 1 146 5.003_21 1997-Jan-15 38 10 221 5.003_22 1997-Jan-16 4 0 18 5.003_23 1997-Jan-25 71 15 119 5.003_24 1997-Jan-29 426 1 20 5.003_25 1997-Feb-04 21 8 169 5.003_26 1997-Feb-10 16 1 15 5.003_27 1997-Feb-18 32 10 38 5.003_28 1997-Feb-21 58 4 66 5.003_90 1997-Feb-25 22 2 34 5.003_91 1997-Mar-01 37 1 39 5.003_92 1997-Mar-06 16 3 69 5.003_93 1997-Mar-10 12 3 15 5.003_94 1997-Mar-22 407 7 200 5.003_95 1997-Mar-25 41 1 37 5.003_96 1997-Apr-01 283 5 261 5.003_97 1997-Apr-03 13 2 34 5.003_97a 1997-Apr-05 57 1 27 5.003_97b 1997-Apr-08 14 1 20 5.003_97c 1997-Apr-10 20 1 16 5.003_97d 1997-Apr-13 8 0 16 5.003_97e 1997-Apr-15 15 4 46 5.003_97f 1997-Apr-17 7 1 33 5.003_97g 1997-Apr-18 6 1 42 5.003_97h 1997-Apr-24 23 3 68 5.003_97i 1997-Apr-25 23 1 31 5.003_97j 1997-Apr-28 36 1 49 5.003_98 1997-Apr-30 171 12 539 5.003_99 1997-May-01 6 0 7 5.003_99a 1997-May-09 36 2 61 p54rc1 1997-May-12 8 1 11 p54rc2 1997-May-14 6 0 40
es: Chip 5.003_08 1996-Nov-19 110 19 424 5.003_09 1996-Nov-26 38 9 248 5.003_10 1996-Nov-29 29 2 27 5.003_11 1996-Dic-06 73 12 165 5.003_12 1996-Dic-19 275 6 436 5.003_13 1996-Dic-20 95 1 56 5.003_14 1996-Dic-23 23 7 333 5.003_15 1996-Dic-23 0 0 1 5.003_16 1996-Dic-24 12 3 50 5.003_17 1996-Dic-27 19 1 14 5.003_18 1996-Dic-31 21 1 32 5.003_19 1997-Ene-04 80 3 85 5.003_20 1997-Ene-07 18 1 146 5.003_21 1997-Ene-15 38 10 221 5.003_22 1997-Ene-16 4 0 18 5.003_23 1997-Ene-25 71 15 119 5.003_24 1997-Ene-29 426 1 20 5.003_25 1997-Feb-04 21 8 169 5.003_26 1997-Feb-10 16 1 15 5.003_27 1997-Feb-18 32 10 38 5.003_28 1997-Feb-21 58 4 66 5.003_90 1997-Feb-25 22 2 34 5.003_91 1997-Mar-01 37 1 39 5.003_92 1997-Mar-06 16 3 69 5.003_93 1997-Mar-10 12 3 15 5.003_94 1997-Mar-22 407 7 200 5.003_95 1997-Mar-25 41 1 37 5.003_96 1997-Abr-01 283 5 261 5.003_97 1997-Abr-03 13 2 34 5.003_97a 1997-Abr-05 57 1 27 5.003_97b 1997-Abr-08 14 1 20 5.003_97c 1997-Abr-10 20 1 16 5.003_97d 1997-Abr-13 8 0 16 5.003_97e 1997-Abr-15 15 4 46 5.003_97f 1997-Abr-17 7 1 33 5.003_97g 1997-Abr-18 6 1 42 5.003_97h 1997-Abr-24 23 3 68 5.003_97i 1997-Abr-25 23 1 31 5.003_97j 1997-Abr-28 36 1 49 5.003_98 1997-Abr-30 171 12 539 5.003_99 1997-May-01 6 0 7 5.003_99a 1997-May-09 36 2 61 p54rc1 1997-May-12 8 1 11 p54rc2 1997-May-14 6 0 40

source: Chip 5.004_05-MT9 1999-Apr-26 5.004_05 1999-Apr-29
es: Chip 5.004_05-MT9 1999-Abr-26 5.004_05 1999-Abr-29

source: Chip 5.004 1997-May-15 A major maintenance release.
es: Chip 5.004 1997-May-15 Versión de mantenimiento importante.

source: Chip Salzenberg gets credit for that, with a nod to his cow orker, David Croy.
es: El mérito le corresponde a Chip Salzenberg, con la ayuda del sabelotodo David Croy.

source: Choose mnemonic identifiers.
es: Elija identificadores mnemotécnicos.

source: Class-based OO is fairly common.
es: La orientación a objetos basada en clases en bastante común.

source: Class::->new()
es: Clase::->new()

source: Clouding the issue is the fact that your machine may implement L</virtual> memory; that is, it will pretend that it has more memory than it really does, and it'll use disk space to hold inactive bits.
es: Algo que enturbia este asunto es el hecho de que el equipo puede tener implementada memoria L</virtual>; es decir, simulará que dispone de más memoria de la que realmente tiene, y usará el espacio en disco para almacenar bits inactivos.

source: Code executed that has side effects may not perform identically from version to version due to the effect of future optimisations in the regex engine.
es: El código ejecutado que tenga efectos secundarios puede no funcionar de forma idéntica de una versión a otra debido al efecto de futuras optimizaciones del motor de expresiones regulares.

source: Coding practices that misuse features, such as C<my $foo if 0>, can also be deprecated.
es: Algunas prácticas de programación que hacen un uso incorrecto de características, como C<my $foo if 0>, también pueden quedar obsoletas.

source: Comments start with a hash symbol and run to the end of the line
es: Los comentarios comienzan con un símbolo # y van hasta el final de la línea:

source: Common types of referents include scalars, arrays, hashes, and subroutines.
es: Algunos tipos comunes de referentes son los escalares, arrays, hashes o subrutinas.

source: Community support in places such as Perlmonks ( http://www.perlmonks.com ) and the various Perl mailing lists ( http://lists.perl.org ) means that you can usually get quick answers to your problems.
es: La comunidad ofrece soporte en foros como Perlmonks ( http://www.perlmonks.com ) y las distintas listas de correo de Perl ( http://lists.perl.org ). Generalmente, siempre que plantee algún problema recibirá rápidamente ayuda para solucionarlo.

source: Compare the following to the examples in C<(*PRUNE)>; note the string is twice as long:
es: Compare lo siguiente con los ejemplos de C<(*PRUNE)>; observe que la cadena es el doble de larga:

source: Compilation errors will tell you the line number of the error, with an indication of the next token or token type that was to be examined.
es: Los errores de compilación le indicarán el número de línea del error, además del siguiente símbolo o tipo de símbolo que iba a ser examinado.

source: Compile phase is mostly spent in L</compile time>, but may also be spent in L</run time> when C<BEGIN> blocks, L<use|perlfunc/use> declarations, or constant subexpressions are being evaluated.
es: Durante la fase de compilación la mayor parte del tiempo se consume en L</tiempo de compilación>, pero también puede usarse en L</tiempo de ejecución> cuando se evalúan los bloques C<BEGIN>, las declaraciones L<use|perlfunc/use> o subexpresiones constantes.

source: Compound types made of a number of smaller pieces generally have operations to compose and decompose them, and perhaps to rearrange them.
es: Los tipos compuestos formados por elementos más pequeños suelen tener operaciones de composición y descomposición, y quizás también de reordenación.

source: Computing MROs can be expensive.
es: El cálculo de órdenes de resolución de métodos puede ser costoso.

source: Conditional expression.
es: Expresión condicional.

source: Consequently, some Perl programmers prefer to avoid them altogether.
es: Como consecuencia, algunos programadores de Perl prefieren evitarlos.

source: Consider arguments as file names; no search in directories will be performed.
es: Especifica que los argumentos son nombres de archivos; no se realizan búsquedas en directorios.

source: Consider changing your whole world view.
es: Debería incluso cambiar su visión del mundo.

source: Consider generalizing your code.
es: Debería generalizar el código.

source: Consider giving away your code.
es: Debería compartir el código.

source: Consider how the pattern above detects no-match on C<((()aaaaaaaaaaaaaaaaaa> in several seconds, but that each extra letter doubles this time.
es: El patrón anterior detecta una no-coincidencia en C<((()aaaaaaaaaaaaaaaaaa> en unos segundos, pero cada letra adicional duplica ese tiempo.

source: Consider making your code run cleanly with C<use strict> and C<use warnings> (or B<-w>) in effect.
es: Debería escribir código más limpio con C<use strict> y C<use warnings> (o B<-w>).

source: Consider the case where some patterns want to be case-sensitive and some do not: The case-insensitive ones merely need to include C<(?i)> at the front of the pattern.
es: Considere el caso en el que algunos patrones distinguen mayúsculas de minúsculas mientras otros no: los que no distinguen mayúsculas de minúsculas solo tienen que incluir C<(?i)> al principio del patrón.

source: Consider the following pattern.
es: Considere el siguiente patrón.

source: Consider the pattern C<A (*PRUNE) B>, where A and B are complex patterns.
es: Considere el patrón C<A (*PRUNE) B>, donde A y B son patrones complejos.

source: Consider this pattern:
es: Considere este patrón:

source: Consider two possible matches, C<AB> and C<A'B'>, C<A> and C<A'> are substrings which can be matched by C<S>, C<B> and C<B'> are substrings which can be matched by C<T>.
es: Consideremos dos posibles coincidencias, C<AB> y C<A'B'>; C<A> y C<A'> son subcadenas que pueden coincidir con C<S>; C<B> y C<B'> son subcadenas que pueden coincidir con C<T>.

source: Consider writing a module or object class.
es: Debería convertir el código en un módulo o una clase de objetos.

source: Consider... oh, never mind.
es: Debería... bueno, ya me callo.

source: Contact the module author instead, or post to comp.lang.perl.modules, or ask someone familiar with Perl on your operating system.
es: Debe ponerse en contacto con el autor del módulo o enviar un mensaje a comp.lang.perl.modules; también puede pedir ayuda a alguien que esté familiarizado con el uso de Perl en su sistema operativo.

source: Contrary to its appearance, C<#[ \t]*> I<is not> the correct subexpression to match the comment delimiter, because it may "give up" some whitespace if the remainder of the pattern can be made to match that way.
es: Contrariamente a lo que parece, C<#[ \t]*> I<no es> la subexpresión correcta para detectar el delimitador de comentario, ya que puede dejarse parte del espacio en blanco si de ese modo consigue detectar el resto del patrón.

source: Converting data from one type to another.
es: Convertir datos de un tipo a otro.
